caseFile/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

L   4.373;
nx  64;

y1  0;
y2  4.373;
ny  64;

H   10;
nz  64;

vertices
(
    (0 $y1 0)   // 0
    ($L $y1 0)  // 1
    ($L $y2 0)  // 2    
    (0 $y2 0)   // 3
    (0 $y1 $H)  // 4
    ($L $y1 $H) // 5
    ($L $y2 $H) // 6
    (0 $y2 $H)  // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    left
    {
        type cyclic;
        neighbourPatch right;
        faces
        (
            (0 1 5 4)
        );
    }
    right
    {
        type cyclic;
        neighbourPatch left;
        faces
        (
            (2 3 7 6)
        );
    }
    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            
            (1 2 6 5)
        );
    }
    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (0 4 7 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
